In [2]:
import pandas as pd

In [4]:
movie_budget = pd.read_csv('./cleaned_data/movie_budgets.csv')
movie_budget.head()

,movie_id,movie_name,release_year_movies,runtime_minutes,genres,averagerating,numvotes,release_date,production_budget,domestic_gross,worldwide_gross
0,tt0249516,foodfight!,2012,91,"action,animation,comedy",1.9,8248,2012-12-31,45000000,0,73706
1,tt0359950,the secret life of walter mitty,2013,114,"adventure,comedy,drama",7.3,275300,2013-12-25,91000000,58236838,187861183
2,tt0365907,a walk among the tombstones,2014,114,"action,crime,drama",6.5,105116,2014-09-19,28000000,26017685,62108587
3,tt0369610,jurassic world,2015,124,"action,adventure,sci-fi",7.0,539338,2015-06-12,215000000,652270625,1648854864
4,tt0376136,the rum diary,2011,119,"comedy,drama",6.2,94787,2011-10-28,45000000,13109815,21544732

In [5]:
# Check for duplicated movie names
duplicated_movies = movie_budget[movie_budget.duplicated(subset=['movie_name'], keep=False)]

# Display the count and the duplicated rows
print(f"Number of duplicated movie names: {duplicated_movies.shape[0]}")
duplicated_movies[['movie_name']].head()

Number of duplicated movie names: 0

Empty DataFrame
Columns: [movie_name]
Index: []

In [7]:
# Filter movie names containing the word 'avengers'
avengers_movies = movie_budget[movie_budget['movie_name'].str.contains('10', case=False, na=False)]

# Display the count and the filtered rows
print(f"Number of movies with 'avengers' in the name: {avengers_movies.shape[0]}")
avengers_movies[['movie_name']].head()

Number of movies with 'avengers' in the name: 3

                 movie_name
186     10 cloverfield lane
1047                   r100
1123  10 days in a madhouse